read_verilog -lib +/ice40/cells_sim.v
hierarchy -check -top rapcore
proc
stat -width