read_verilog -sv testbench/dualh_tb.v
hierarchy -check -top dualh_tb
prep -top dualh_tb
sim -n 80000 -clock clk -resetn resetn -vcd testbench/vcd/dualh.vcd
