
read_verilog -sv testbench/microstepper_tb.v
hierarchy -check -top microstepper_tb
prep -top microstepper_tb
show microstepper_top
sim -n 400000 -clock clk -vcd testbench/vcd/microstepper.vcd
