read_verilog -sv testbench/quad_tb.v
hierarchy -check -top testbench
prep -top testbench
sim -n 400 -clock clk -vcd testbench/vcd/quadenc.vcd
