
read_verilog -sv testbench/rapcore_tb.v
hierarchy -check -top rapcore_tb
prep -top rapcore_tb
sim -n 40000 -clock CLK -vcd testbench/vcd/rapcore.vcd
