
read_verilog -sv testbench/spi_tb.v
hierarchy -check -top testbench
prep -top testbench
sim -n 10000 -clock clk -vcd testbench/vcd/spi.vcd
