
read_verilog -sv testbench/spi_state_machine_tb.v
hierarchy -check -top testbench
prep -top testbench
sim -n 100000 -clock clk -vcd testbench/vcd/spifsm.vcd
